Repository: kaplanPRO/kaplan-cloud
Catalog: docs/source/locale/*/LC_MESSAGES/installation.po
Languages: tr

source: Installation
tr: Kurulum

source: Local installation with Docker
tr: Docker ile yerel kurulum

source: Follow `these instructions <https://docs.docker.com/get-docker>`_ to install Docker.
tr: `Buradaki talimatları <https://docs.docker.com/get-docker>`_ izleyerek Docker kurulumunu tamamlayın.

source: Deploy a `Kaplan Cloud container <https://hub.docker.com/r/kaplanpro/cloud>`_:
tr: Bir `Kaplan Bulut konteyneri <https://hub.docker.com/r/kaplanpro/cloud>`_ başlatın:

source: Please note that with Docker containers, storage is ephemeral. This means that when you upgrade to a newer version, you will essentially remove the container and its contents along with any work you may have done. Docker solves this with `mounts/volumes <https://docs.docker.com/storage/volumes/>`_. If you would like to just fiddle around with Kaplan Cloud, the invocation below is all you need:
tr: Docker konteynerlerinde depolanan veriler kalıcı değildir. Sürüm yükselteceğinizde konteyneri, içindki verileri ve çalışmalarınızı silmiş olacaksınız. Docker'ın bu durumuma çözümü ise `mount/volume <https://docs.docker.com/storage/volumes/>`_. Amacınız Kaplan Bulut'u kurcalamak ise aşağıdaki komutu kullanmanız yeterli:

source: However, if you'd like your data to persist, you'll first need to create some directories and files, which we will attach (or bind) to the container:
tr: Ancak verilerinizi kaybetmemek istiyorsanız birkaç dizin ve dosya oluşturup konteynere bağlamanız gerekiyor:

source: Now, let's start the container with them attached:
tr: Konteyneri az önce oluşturduğumuz dosya ve dizinler bağlı şekilde başlatalım:

source: Create an admin (superuser) account:
tr: Yönetici (süper kullanıcı) hesabı oluşturun:

source: We're done! Head on over to http://0.0.0.0:8080 and explore Kaplan Cloud.
tr: İşlem tamam! http://0.0.0.0:8080'i açıp Kaplan Bulut'u keşfetmeye başlayabilirsiniz.

source: Production installation with Docker Compose
tr: Docker Compose ile üretim ortamında kurulum

source: Follow `these instructions <https://docs.docker.com/compose/install>`_ to install Docker Compose.
tr: `Buradaki talimatları <https://docs.docker.com/compose/install>`_ izleyerek Docker Compose kurulumunu tamamlayın.

source: If you have not set a dedicated Docker network for your proxy tier, create one:
tr: Proxy katmanınız için ayrı bir Docker ağınız mevcut değilse oluşturun:

source: Replace "network-name" with an arbitrary name of your choosing.
tr: "network-name" yerine istediğiniz herhangi bir ismi girin.

source: If you do not already have one, deploy an `nginxproxy/nginx-proxy container <https://hub.docker.com/r/nginxproxy/nginx-proxy>`_:
tr: Halihazırda yoksa bir `nginxproxy/nginx-proxy konteyneri <https://hub.docker.com/r/nginxproxy/nginx-proxy>`_ başlatın:

source: This container will be routing traffic to your Kaplan Cloud instance.
tr: Bu konteyner gelen trafiği Kaplan Bulut örneğinize yönlendirecek.

source: If you do not already have one, deploy an `nginxproxy/acme-companion container <https://hub.docker.com/r/nginxproxy/acme-companion>`_:
tr: Halihazırda yoksa bir `nginxproxy/acme-companion konteyneri <https://hub.docker.com/r/nginxproxy/acme-companion>`_ konteyneri başlatın:

source: This container will be provisioning free SSL certificates for your Kaplan Cloud instance.
tr: Bu konteyner, Kaplan Bulut örneğiniz için ücretsiz SSL sertifikaları hazırlayacak.

source: Download the repository from here and enter the .docker directory.
tr: Kod deposunu buradan indirip .docker dizinize girin.

source: You will find three \*.env.template files. Create .env, db.env and web.env files following the guidance on the templates.
tr: Burada adı \*.env.template ile sonlanan 3 şablon göreceksiniz. İçlerindeki yönergeleri izleyerek .env, db.env ve web.env dosyalarını hazırlayın.

source: Use docker-compose to run the containers::
tr: docker-compose kullanarak konteynerleri başlatın::

source: If, for some reason, this step fails, run this command without the -d flag to see what went wrong::
tr: Olur da bu adımda hata alırsanız aynı komutu -d işareti olmadan çalıştırarak sorunlu kısmı tespit edebilirsiniz::

source: Create an admin (superuser) account::
tr: Yönetici (süper kullanıcı) hesabı oluşturun::

source: Additional steps for Cloudflare users
tr: Cloudflare kullanıcıları için ek adımlar

source: Add the following page rule:
tr: Aşağıdaki sayfa kuralını ekleyin:

source: It might take a minute or two for the SSL certificate to kick in.
tr: SSL sertifikanızın devreye girmesi birkaç dakika alabilir.
