Repository: kaplanPRO/kaplan-cloud
Catalog: docs/source/locale/*/LC_MESSAGES/pre-installation-configuration.po
Languages: tr

source: Pre-Installation Configuration
tr: Kurulum Öncesi Yapılandırma

source: File storage
tr: Dosya depolama

source: You should not change the type of storage post-installation. Your files will not be moved to the new storage automatically. You'd need to copy them over manually.
tr: Depolama türünü kurulum sonrasında değiştirmeyin. Dosyalarınız yeni depolama alanına otomatik olarak taşınmaz. Elle kopyalamanız gerekir.

source: For the purposes of this documentation, private content refers to project files, packages, etc. while public content refers to the style and logic files (CSS, JS, etc.) required for Kaplan Cloud to function in users' web browsers.
tr: Bu dokümantasyonda *genel erişime kapalı içerik* ifadesi proje dosyası, paket vb. dosyaları, *genel erişime açık içerik* ifadesi ise Kaplan Bulut'un kullanıcıların internet tarayıcılarında işleyebilmesi için gerekli biçim ve mantık dosyalarını (CSS, JS vb.) ifade eder.

source: Local
tr: Yerel

source: Local file storage does not require additional configuration. Static files, which are needed for the app to function are stored at *$PROJECT_DIR/staticfiles*. Project files, packages and others are stored at *$PROJECT_DIR/kaplancloudapp/projects*.
tr: Yerel dosya depolamak için ek yapılandırma gerekmez. Uygulamanın işlemesi için gerekli statik dosyalar *$PROJE_DİZİNİ/staticfiles* dizininde saklanırken proje dosyaları, paketler vb. ise *$PROJE_DİZİNİ/kaplancloudapp/projects* dizininde saklanır.

source: Kaplan Cloud depends on `django-storages <https://django-storages.readthedocs.io/en/latest/backends/gcloud.html>`_ to offer Google Cloud Storage support.
tr: Kaplan Bulut, Google Cloud Storage desteği için `django-storages <https://django-storages.readthedocs.io/en/latest/backends/gcloud.html>`_ paketinden destek almaktadır.

source: Create a bucket (`Create a new bucket`_) and make sure to set control to *Fine-grained* (`Choose between uniform and fine-grained access`_). You will set the environment variables ``GS_PUBLIC_BUCKET_NAME`` and ``GS_PRIVATE_BUCKET_NAME`` to the name of this bucket.
tr: Bir kova oluşturun (`Yeni kova oluşturma`_) ve *Fine-grained* kontrol modelini (`Uniform ve fine-grained erişim arasında seçim`_) seçin. ``GS_PUBLIC_BUCKET_NAME`` ve ``GS_PRIVATE_BUCKET_NAME`` ortam değişkenlerini bu kovanın adı olarak ayarlayacaksınız.

source: Create a service account and make sure it has read and write access to your bucket (`Creating a Service Account`_).
tr: Bir hizmet hesabı oluşturup kovanıza okuma ve yazma erişimi verin (`Hizmet Hesabı Oluşturma`_).

source: Create and download an access key for your service account. You will set the environment variable ``GOOGLE_APPLICATION_CREDENTIALS`` to the path to this key file.
tr: Hizmet hesabınız için bir erişim anahtarı oluşturup indirin. ``GOOGLE_APPLICATION_CREDENTIALS`` ortam değişkenini bu anahtar dosyasının dosya yoluna ayarlayacaksınız.

source: By default, public content will be saved under the */static* directory, while private content will be saved under the */kaplancloudapp/projects* directory. You can change these directories by setting the environment variables ``GS_PUBLIC_BUCKET_LOCATION`` and ``GS_PRIVATE_BUCKET_LOCATION``
tr: Varsayılan ayarları değiştirmediğinizde genel erişime açık içeriğiniz */static* dizininde, genel erişime kapalı içeriğiniz ise */kaplancloudapp/projects* dizininde saklanır. Bunu ``GS_PUBLIC_BUCKET_LOCATION`` ve ``GS_PRIVATE_BUCKET_LOCATION`` ortam değişkenlerini kullanarak değiştirebilirsiniz.

source: Kaplan Cloud depends on `django-storages <https://django-storages.readthedocs.io/en/latest/backends/amazon-S3.html>`_ to offer S3 support.
tr: Kaplan Bulut, S3 desteği için `django-storages <https://django-storages.readthedocs.io/en/latest/backends/amazon-S3.html>`_ paketinden destek almaktadır.

source: Separate buckets for private and public content (recommended)
tr: Genel erişime kapalı ve açık içerikler için ayrı kovalar (önerilen)

source: Create the public bucket (`Creating a bucket`_). Make sure to uncheck **Block all public access**. You will set the environment variable ``S3_PUBLIC_BUCKET`` to the name of the bucket, and ``S3_REGION_NAME`` to the bucket's region.
tr: Genel erişime açık kovayı oluşturun (`Kova oluşturma`_). **Block all public access** seçeneğinin işaretini kaldırmayı unutmayın. ``S3_PUBLIC_BUCKET`` ortam değişkenini bu kovanın adı, ``S3_REGION_NAME`` ortam değişkenini ise kovanın bölgesi olarak ayarlayacaksınız.

source: For your public content to be actually public, you'll need to set the environment variable ``GS_DEFAULT_ACL`` to ``public-read``. This will not affect your private content.
tr: Genel erişime açık içeriğinizin ulaşılabilir olması için ``GS_DEFAULT_ACL`` ortam değişkenini ``public-read`` olarak ayarlamanız gerekiyor. Bu ayar, genel erişime kapalı içeriğinizi etkilemez.

source: Edit the bucket's policy to allow anonymous read access (`Using bucket policies`_). Below is a policy example, change ``mypublicbucket`` to the name of your bucket:
tr: Kovanın politikasını düzenleyip anonim okuma izni tanımlayın (`Kova politikaları kullanma`_). Aşağıdaki örnek politikayı kullanabilirsiniz. ``mypublicbucket`` değerini kovanızın adıyla değiştirin.

source: Create the private bucket (`Creating a bucket`_). You will set the environment variable ``S3_PRIVATE_BUCKET`` to the name of this bucket.
tr: Genel erişime kapalı kovayı oluşturun (`Kova oluşturma`_). ``S3_PRIVATE_BUCKET`` ortam değişkenini bu kovanın adı olarak ayarlayacaksınız.

source: Head over to IAM and create a policy with full access to these buckets. Change ``arn:aws:s3:::myprivatebucket`` and ``arn:aws:s3:::mypublicbucket`` to the names of your buckets (`AWS IAM Docs`_).
tr: IAM sayfasına girip bu kovalara tam erişim veren bir politika oluşturun. ``arn:aws:s3:::myprivatebucket`` ve ``arn:aws:s3:::mypublicbucket`` yerine kendi kovalarınızın adlarını yazın (`AWS IAM Dokümantasyonu`_).

source: Under Users, create a user for **Access key - Programmatic access** and attach the policy we created at the previous step (`Creating IAM users`_).
tr: Users sekmesinde **Access key - Programmatic access** için kullanıcı oluşturup bir önceki adımda oluşturduğumuz politikayı bu kullanıcıya bağlayın (`IAM kullanıcıları oluşturma`_).

source: At the final step, you will be presented with your credentials. You'll set the environment variable ``S3_ACCESS_KEY_ID`` to **Access key ID**, and ``S3_SECRET_ACCESS_KEY`` to **Secret access key**.
tr: Son adımda erişim bilgilerinizi göreceksiniz. ``S3_ACCESS_KEY_ID`` ortam değişkenini **Access key ID**, ``S3_SECRET_ACCESS_KEY`` ortam değişkenini ise **Secret access key** hanesinde yazan değer olarak ayarlayın.

source: By default, static files will be saved under */static* in the public bucket, and project files will be saved under the root directory of the private bucket. You can change these directories by setting the environment variables ``S3_PUBLIC_BUCKET_LOCATION`` and ``S3_PRIVATE_BUCKET_LOCATION``
tr: Varsayılan ayarları değiştirmediğinizde statik dosyalarınız genel erişime açık kovada */static* dizininde kaydedilirken proje dosyaları genel erişime kapalı kovanın kaynak dizinide kaydedilir. Bunu ``S3_PUBLIC_BUCKET_LOCATION`` ve ``S3_PRIVATE_BUCKET_LOCATION`` ortam değişkenlerini kullanarak değiştirebilirsiniz.

source: Single bucket
tr: Tek kova

source: Create a new bucket with ACL enabled and Block all public access unticked (`Creating a bucket`_). You will set the environment variables ``S3_PRIVATE_BUCKET`` and ``S3_PUBLIC_BUCKET`` to the name of this bucket.
tr: Bir kova oluşturun. ACL'yi etkinleştirin ve Block all public access ayarının işaretini kaldırın (`Kova oluşturma`_). ``S3_PRIVATE_BUCKET`` ve ``S3_PUBLIC_BUCKET`` ortam değişkenlerini bu kovanın adı olarak ayarlayacaksınız.

source: For your public content to be actually public, you'll need to set the environment variable ``S3_DEFAULT_ACL`` to ``public-read``. This will not affect your private content.
tr: Genel erişime açık içeriğinizin ulaşılabilir olması için ``S3_DEFAULT_ACL`` ortam değişkenini ``public-read`` olarak ayarlamanız gerekiyor. Bu ayar, genel erişime kapalı içeriğinizi etkilemez.

source: Head over to IAM and create a policy with full access to this bucket. Change ``arn:aws:s3:::mybucket`` to the name of your bucket (`AWS IAM Docs`_).
tr: IAM sayfasına girip bu kovaya tam erişim veren bir politika oluşturun. ``arn:aws:s3:::mybucket`` yerine kendi kovanızın adını yazın (`AWS IAM Dokümantasyonu`_).

source: By default, public content will be saved under the */static* directory, while private content will be saved under the */kaplancloudapp/projects* directory. You can change these directories by setting the environment variables ``S3_PUBLIC_BUCKET_LOCATION`` and ``S3_PRIVATE_BUCKET_LOCATION``
tr: Varsayılan ayarları değiştirmediğinizde genel erişime açık içerik */static* dizininde, genel erişime kapalı içerik ise */kaplancloudapp/projects* dizininde saklanır. Bunu ``S3_PRIVATE_BUCKET_LOCATION`` ve ``S3_PUBLIC_BUCKET_LOCATION`` ortam değişkenlerini kullanarak değiştirebilirsiniz.
