Repository: kaplanPRO/kaplan-cloud
Catalog: docs/source/locale/*/LC_MESSAGES/projects.po
Languages: tr

source: Projects
tr: Proje

source: Create a project
tr: Proje oluşturma

source: Log in with your admin or PM account.
tr: Yönetici ya da PM hesabınızla oturum açın.

source: Go to the Projects tab and click Create.
tr: Projects (Projeler) sekmesine girip Create (Oluştur) düğmesine tıklayın.

source: Projects tab
tr: Projeler sekmesi

source: Fill out the form, select files, and submit.
tr: Formu doldurun, ilgili dosyaları seçin ve gönderin.

source: Project form
tr: Proje formu

source: Once all files are processed and if there are no errors, a project analysis will be run. When the analysis is ready, the project will be moved to the Ready for Translation stage. To move on, you'll need to assign team members as translator/reviewer for the files.
tr: Tüm dosyalar işlendiğinde ve herhangi bir hata meydana gelmezse proje analizi başlatılır. Analiz tamamlandığında proje Çeviriye Hazır aşamasına geçer. Buradan devam etmek için ekip üyelerini dosyalara çevirmen/editör olarak atamanız gerekir.

source: Assign team members
tr: Ekip üyesi atama

source: Open the project and tick the checkboxes for the file(s) you wish to assign to a team member. No ticks means all files.
tr: Projeyi açıp ekip üyesi atamak istediğiniz dosyaların kutucuğunu işaretleyin. Hiçbir kutucuğu işaretlemediğinizde tüm dosyalar için işlem yapmak istediğiniz varsayılır.

source: Right click anywhere on the page and select the appropriate function based on whether you wish to assign the team member as a translator or reviewer.
tr: Sayfanın herhangi bir noktasında sağ tıklayıp açılan menüden çevirmen ya da editör atamayla ilgili işlevi seçin.

source: Files context menu
tr: Dosya bağlam menüsü

source: Enter the username of the team member and submit the form.
tr: Ekip üyesinin kullanıcı adını girip formu gönderin.

source: Assign team member form
tr: Ekip üyesi atama formu
