Repository: kaplanPRO/kaplan-cloud
Catalog: docs/source/locale/*/LC_MESSAGES/try-for-free-online.po
Languages: tr

source: Try for Free Online
tr: Çevrim İçi Ücretsiz Deneme

source: You may need to set up a project for this to work; however, you won't be asked for billing information, or charged. You will be using your weekly GCP Cloud Shell quota.
tr: Öncelikle proje oluşturmanız gerekebilir. Ödeme belgeleri istenmez ve ücret kesilmez. Haftalık ücretsiz GCP Cloud Shell kotanızdan kullanacaksınız.

source: 1. Head on over to https://console.cloud.google.com/ and click **Activate Cloud Shell** at top right corner and wait for your Cloud Shell machine to be provisioned.
tr: 1. https://console.cloud.google.com/ adresine girip sağ üstten **Activate Cloud Shell** düğmesini tıklayın. Cloud Shell makinenizin hazırlanmasını bekleyin.

source: Activate GCP Cloud Shell
tr: GCP Cloud Shell etkinleştirme

source: Run a Kaplan Cloud container:
tr: Kaplan Bulut konteyneri çalıştırın:

source: Run a Kaplan Cloud container
tr: Kaplan Bulut konteyneri çalıştırma

source: Create a superuser account:
tr: Süper kullanıcı hesabı oluşturun:

source: Create a superuser account
tr: Süper kullanıcı hesabı oluşturma

source: Click **Web Preview** and then **Preview on port 8080**
tr: **Web Preview** düğmesini tıklayıp **Preview on port 8080** şıkkını seçin.

source: Web Preview button
tr: Web Preview düğmesi

source: You should see the login page. You might need to give it a moment.
tr: Oturum açma sayfasını göreceksiniz. Biraz beklemeniz gerekebilir.

source: Web Preview login page
tr: Web Preview oturum açma sayfası

source: Log in with your credentials and give Kaplan Cloud a try!
tr: Oturum açıp Kaplan Bulut'u deneyin!

source: Web Preview homepage
tr: Web Preview ana sayfa
