Repository: kaplanPRO/kaplan-cloud
Catalog: docs/source/locale/*/LC_MESSAGES/users.po
Languages: tr

source: Users
tr: Kullanıcı

source: Add a user
tr: Kullanıcı ekleme

source: Log in with your admin account at yourdomain.tld/admin, find User registration tokens from the left side bar and click ADD USER REGISTRATION TOKEN:
tr: Yönetici hesabınızla yönetici sayfasında (ör. yourdomain.tld/admin) oturum açın. Sol tarafta User registration tokens (Kullanıcı kayıt jetonları) şıkkını seçip ADD USER REGISTRATION TOKEN (KULLANICI KAYIT JETONU EKLE) düğmesini tıklayın:

source: User Registration Token
tr: Kullanıcı Kayıt Jetonu

source: Select the type of user account and click SAVE:
tr: Kullanıcı türünü seçip Save (Kaydet) düğmesini tıklayın:

source: User Registration Token form
tr: Kullanıcı Kayıt Jetonu formu

source: Provide the new team member with the token and the link to the registration page (yourdomain.tld/accounts/register).
tr: Jetonu ve kayıt sayfasının bağlantısını (yourdomain.tld/accounts/register) yeni ekip üyesine iletin.

source: Registration
tr: Kayıt

source: Go to the registration page (eg. yourdomain.tld/accounts/register).
tr: Kayıt sayfasını açın (ör. yourdomain.tld/accounts/register).

source: Enter your details and the token you were provided with.
tr: Bilgilerinizi ve size iletilen jetonu girin.

source: User registration form
tr: Kullanıcı kayıt formu
